# dars(7)

In [7]:
import pandas as pd
df=pd.read_csv("C:/Users/User/Downloads/Telegram Desktop/IMDB_Movies_Dataset.csv")

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4991 entries, 0 to 4990
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         4991 non-null   object
 1   Title              4991 non-null   object
 2   Average Rating     4989 non-null   float64
 3   Director           4991 non-null   object
 4   Writer             4990 non-null   object
 5   Metascore          3057 non-null   float64
 6   Cast               4984 non-null   object
 7   Release Date       4991 non-null   object
 8   Country of Origin  4988 non-null   object
 9   Languages          4970 non-null   object
 10  Budget             2653 non-null   object
 11  Worldwide Gross    3897 non-null   object
 12  Runtime            4991 non-null   object
 13  Writer.1           4990 non-null   object
 14  Average Rating.1   4991 non-null   float64
dtypes: float64(3), object(12)
memory usage: 585.0+ KB

In [9]:
df.head()

,Unnamed: 0,Title,Average Rating,Director,Writer,Metascore,Cast,Release Date,Country of Origin,Languages,Budget,Worldwide Gross,Runtime,Writer.1,Average Rating.1
0,0,The Shawshank Redemption,9.3,Frank Darabont,"Stephen King, Frank Darabont",82.0,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...","October 14, 1994 (India)",United States,English,"$25,000,000 (estimated)","$29,332,133",2 hours 22 minutes,"Stephen King, Frank Darabont",9.3
1,1,Attack on Titan the Movie: The Last Attack,9.3,Yûichirô Hayashi,"Natsuki Hanae, Yoshimasa Hosoya, Marina Inoue",NaN,"Natsuki Hanae, Yoshimasa Hosoya, Marina Inoue,...","November 8, 2024 (Japan)",Japan,Japanese,NaN,"$3,513,659",2 hours 25 minutes,"Natsuki Hanae, Yoshimasa Hosoya, Marina Inoue",9.3
2,2,The Godfather,9.2,Francis Ford Coppola,"Mario Puzo, Francis Ford Coppola",100.0,"Marlon Brando, Al Pacino, James Caan, Diane Ke...",1978 (India),United States,"English, Italian, Latin","$6,000,000 (estimated)","$250,342,198",2 hours 55 minutes,"Mario Puzo, Francis Ford Coppola",9.2
3,3,Hababam Sinifi,9.2,Ertem Egilmez,"Umur Bugay, Rifat Ilgaz",NaN,"Münir Özkul, Tarik Akan, Halit Akçatepe, Kemal...","April 1, 1975 (Turkey)",Turkey,Turkish,NaN,NaN,1 hour 25 minutes,"Umur Bugay, Rifat Ilgaz",9.2
4,4,Ramayana: The Legend of Prince Rama,9.2,"Ram Mohan, Yûgô Sakô, Koichi Saski","Rani Burra, Ram Mohan, Yûgô Sakô",NaN,"Arun Govil, Nikhil Kapoor, Edie Mirman, Rael P...","September 25, 2001 (India)","India, Japan",English,NaN,NaN,2 hours 15 minutes,"Rani Burra, Ram Mohan, Yûgô Sakô",9.2

In [12]:
df["Budget"]

0       $25,000,000 (estimated)
1                           NaN
2        $6,000,000 (estimated)
3                           NaN
4                           NaN
                 ...
4986                        NaN
4987     €7,000,000 (estimated)
4988                        NaN
4989    $25,000,000 (estimated)
4990    $25,000,000 (estimated)
Name: Budget, Length: 4991, dtype: object

In [14]:
df["Budget"]=df["Budget"].str.replace(r'[^\d.]','',regex=True).astype(float)

In [ ]:
df["Budget"]

0       25000000.0
1              NaN
2        6000000.0
3              NaN
4              NaN
           ...
4986           NaN
4987     7000000.0
4988           NaN
4989    25000000.0
4990    25000000.0
Name: Budget, Length: 4991, dtype: float64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4991 entries, 0 to 4990
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         4991 non-null   object
 1   Title              4991 non-null   object
 2   Average Rating     4989 non-null   float64
 3   Director           4991 non-null   object
 4   Writer             4990 non-null   object
 5   Metascore          3057 non-null   float64
 6   Cast               4984 non-null   object
 7   Release Date       4991 non-null   object
 8   Country of Origin  4988 non-null   object
 9   Languages          4970 non-null   object
 10  Budget             2653 non-null   float64
 11  Worldwide Gross    3897 non-null   object
 12  Runtime            4991 non-null   object
 13  Writer.1           4990 non-null   object
 14  Average Rating.1   4991 non-null   float64
dtypes: float64(4), object(11)
memory usage: 585.0+ KB

In [17]:
df["Runtime"]=df["Runtime"].str.replace(r'[^\d.]','', regex=True).astype(float)

In [18]:
df["Runtime"]

0       222.0
1       225.0
2       255.0
3       125.0
4       215.0
        ...
4986    213.0
4987    130.0
4988    153.0
4989    222.0
4990    222.0
Name: Runtime, Length: 4991, dtype: float64

In [19]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4986    False
4987    False
4988    False
4989     True
4990     True
Length: 4991, dtype: bool

In [20]:
df.duplicated().sum()

np.int64(2)

In [21]:
df[df.duplicated()]

,Unnamed: 0,Title,Average Rating,Director,Writer,Metascore,Cast,Release Date,Country of Origin,Languages,Budget,Worldwide Gross,Runtime,Writer.1,Average Rating.1
4989,0,The Shawshank Redemption,9.3,Frank Darabont,"Stephen King, Frank Darabont",82.0,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...","October 14, 1994 (India)",United States,English,25000000.0,"$29,332,133",222.0,"Stephen King, Frank Darabont",9.3
4990,0,The Shawshank Redemption,9.3,Frank Darabont,"Stephen King, Frank Darabont",82.0,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...","October 14, 1994 (India)",United States,English,25000000.0,"$29,332,133",222.0,"Stephen King, Frank Darabont",9.3

In [23]:
df=df.drop_duplicates()

In [24]:
df.duplicated().sum()

np.int64(0)

In [26]:
df[df.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0, Title, Average Rating, Director, Writer, Metascore, Cast, Release Date, Country of Origin, Languages, Budget, Worldwide Gross, Runtime, Writer.1, Average Rating.1]
Index: []

In [27]:
df.T.duplicated()

Unnamed: 0           False
Title                False
Average Rating       False
Director             False
Writer               False
Metascore            False
Cast                 False
Release Date         False
Country of Origin    False
Languages            False
Budget               False
Worldwide Gross      False
Runtime              False
Writer.1              True
Average Rating.1     False
dtype: bool

In [28]:
df.T.duplicated().sum()

np.int64(1)

In [30]:
df.T[df.T.duplicated()]

,0,1,2,3,4,5,6,7,8,9,...,4979,4980,4981,4982,4983,4984,4985,4986,4987,4988
Writer.1,"Stephen King, Frank Darabont","Natsuki Hanae, Yoshimasa Hosoya, Marina Inoue","Mario Puzo, Francis Ford Coppola","Umur Bugay, Rifat Ilgaz","Rani Burra, Ram Mohan, Yûgô Sakô",Suzanne Bernert,"Pingali Nagendra Rao, Kadiri Venkata Reddy","Jonathan Nolan, Christopher Nolan, David S. Goyer","Thomas Keneally, Steven Zaillian",Reginald Rose,...,"Leila Conners, Nadia Conners, Leonardo DiCaprio",Samuel Maoz,"Hiroyuki Yamaga, Hiroshi Ônogi","Mahesh Bhatt, Girish Dhamija, Anurag Basu",Nuran Evren Sit,"Jorge Guerricaechevarría, Álex de la Iglesia","Roy Chanslor, Arthur Conan Doyle","Hiroshi Takahashi, Shôgo Mutô","Ruben Alves, Luc-Olivier Veuve, Jean-André Yerlès",Kwak Kyung-taek

In [32]:
df=df.loc[:,~df.T.duplicated()]

In [33]:
df.T[df.T.duplicated()]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]
Index: []

[0 rows x 4989 columns]